Tekla.Structures.DialogInternal.ManagedProfileSelectionDialogInterface
Handles access to object dialog callbacks

Tekla.Structures.DialogInternal.ManagedProfileSelectionDialogInterface.AttributeRequestedEvent
The attribute requested event

Tekla.Structures.DialogInternal.ManagedProfileSelectionDialogInterface.UseOldProfileCatalog
Environment value for old profile catalog.
Returns: false if event handler is not specified , true otherwise

Tekla.Structures.DialogInternal.ManagedProfileSelectionDialogInterface.AttributeRequestedCallback(Tekla.Structures.DialogInternal.IDialogOwner,System.String,System.Int32)
Callback function to be called from forms dialog
caller: Caller control
profile: Profile name
flag: Flag dummy
Returns: false if event handler is not specified , true otherwise